In [1]:
import main
import psycopg2 as pg
import pandas as pd
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [2]:
df = main.film_in_category(1)
df

                     title              language category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [3]:
df = main.number_films_in_category(2)
df

    category  count
0  Animation     66

In [2]:
df = main.number_film_by_length(40, 50)
df

   length  count
0      46      5
1      47      7
2      48     11
3      49      5
4      50      9

In [15]:
df = main.client_from_city("Barcelona")
df

        city first_name last_name
0  Barcelona     Julian      Vest

In [2]:
df = main.avg_amount_by_length(48)
df

   length       avg
0      48  4.137569

In [2]:
df = main.client_by_sum_length(3500)
df

    first_name last_name   sum
0        Craig   Morrell  3502
1       Manuel   Murrell  3504
2       Jeanne    Lawson  3508
3        Angel   Barclay  3510
4       Marion    Ocampo  3512
..         ...       ...   ...
137      Clara      Shaw  4808
138     Wesley      Bull  4808
139      Tammy   Sanders  5065
140    Eleanor      Hunt  5360
141       Karl      Seal  5388

[142 rows x 3 columns]

In [2]:
df = main.category_statistic_length('Sports')
df

     name         avg   sum  min  max
0  Sports  128.202703  9487   47  184